app/views/scholarships/show.html.erb

                        </p>
                        <% if @scholarship.institution.website.present? %>
---
SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = 1 LIMIT 1