app/views/admin/institutions/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 10 ORDER BY "users"."id" ASC LIMIT 1
---
                    <% end %>
                    <% if institution.user.present? %>