app/views/admin/institutions/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
                        <!-- Administrateur -->
                        <% if @institution.user.present? %>