app/controllers/admin/dashboard_controller.rb

  def index
    @stats = {
      total_users: User.count,
      studients_count: User.where(role: 'student').count,
      institutions_count: User.where(role: 'institution').count,
      total_scholarships: Scholarship.count,
      active_scholarships: Scholarship.published.count,
      pending_scholarships: Scholarship.where(active: false).count,
      total_institutions: Institution.count
    }

    @recent_users = User.order(created_at: :desc).limit(6)
    @recent_scholarships = Scholarship.includes(:institution).order(created_at: :desc).limit(6)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT 6
SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" IN (2, 3)
SELECT "scholarships".* FROM "scholarships" ORDER BY "scholarships"."created_at" DESC LIMIT 6