app/controllers/admin/institutions_controller.rb

SELECT "institutions".* FROM "institutions" ORDER BY "institutions"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (13, 12)
---
  def index
    @institutions = Institution.includes(:user).order(created_at: :desc)

INSERT INTO "institutions" ("user_id", "name", "description", "country", "city", "website", "contact_email", "contact_phone", "logo_url", "created_at", "updated_at") VALUES (14, 'anab-Niger', 'arfait ! J''ai créé un guide complet avec toutes les commandes nécessaires pour ton projet.
SELECT "users".* FROM "users" WHERE "users"."id" = 10 ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "first_name", "last_name", "phone", "role", "created_at", "updated_at") VALUES ('tunis@gmail.com', '$2a$12$pMq0l48Hx1RPd2FTAihANu7dtjMAyxTubh7ISn2lwH6ZHs0KEydWS', NULL, NULL, NULL, 'Garba', 'Farouk', '+227 91232323', 'institution', '2025-07-07 10:48:44.233097', '2025-07-07 10:48:44.233097') RETURNING "id"
---
  def create
    @institution = Institution.create(institution_params)
    @institution.user.role = 'institution' if @institution.user.present?
    if @institution.save

DELETE FROM "institutions" WHERE "institutions"."id" = 3
---
  def destroy
    @institution.destroy

SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = 3 LIMIT 1
---
  def set_institution
    @institution = Institution.find(params[:id])