app/controllers/admin/scholarships_controller.rb

SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" IN (2, 3)
SELECT "scholarships".* FROM "scholarships" ORDER BY "scholarships"."created_at" DESC
---
  def index
    @scholarships = Scholarship.includes(:institution).order(created_at: :desc)

INSERT INTO "scholarships" ("institution_id", "title", "description", "requirements", "benefits", "level", "field_of_study", "country", "city", "pourcentage", "scholarship_type", "duration_months", "application_deadline", "program_start_date", "language", "age_min", "age_max", "gender_requirement", "external_application_url", "active", "created_at", "updated_at") VALUES (2, 'Bourse Partial', 'arfait ! Ça a marché parce que vous avez ciblé précisément l''élément problématique. Voici pourquoi cette solution a fonctionné :
---
  def create
    @scholarship = Scholarship.new(scholarship_params)
    if @scholarship.save

DELETE FROM "scholarships" WHERE "scholarships"."id" = 3
---
  def destroy
    @scholarship.destroy

SELECT "scholarships".* FROM "scholarships" WHERE "scholarships"."id" = NULL LIMIT 1
---
  def set_scholarship
    @scholarship = Scholarship.find(params[:id])