app/views/admin/scholarships/_form.html.erb

SELECT "institutions".* FROM "institutions"
---
            <%= form.label :institution_id, "Institution", class: "block text-sm font-semibold text-gray-700 mb-3" %>
            <%= form.collection_select :institution_id, Institution.all, :id, :name,
                { prompt: "Sélectionnez une institution" },
                { class: "w-full px-4 py-3 border border-gray-300 rounded-xl focus:ring-2 focus:ring-indigo-500 focus:border-indigo-500 transition-all duration-200 bg-white shadow-sm hover:shadow-md" } %>