app/controllers/institution/dashboards_controller.rb

  def index
    @total_scholarships = current_user.institution.scholarships.count
    @total_scholarships_active = current_user.institution.scholarships.published.count
    @total_scholarships_inactive = current_user.institution.scholarships.where(active: false).count

    @scholarships = current_user.institution.scholarships

    # Recherche textuelle (titre ou statut)
    if params[:search].present?
      @scholarships = @scholarships.search_by_name_and_status(params[:search])
    end

    # Filtrage complémentaire par statut (si status est un booléen)
    if params[:status].present?
      if params[:status] == "Actif"
        @scholarships = @scholarships.where(active: true)
---
SELECT COUNT(*) FROM "institutions"
SELECT COUNT(*) FROM "scholarships" WHERE "scholarships"."institution_id" = 2
SELECT COUNT(*) FROM "scholarships" WHERE "scholarships"."institution_id" = 2 AND "scholarships"."active" = TRUE
SELECT COUNT(*) FROM "scholarships" WHERE "scholarships"."institution_id" = 2 AND "scholarships"."active" = FALSE
SELECT "scholarships".* FROM "scholarships" WHERE "scholarships"."institution_id" = 2 AND "scholarships"."active" = TRUE