app/controllers/institution/scholarships_controller.rb

  def create
  @institution = current_user.institution
  @scholarship = @institution.scholarships.new(scholarship_params)
  if @scholarship.save
---
INSERT INTO "scholarships" ("institution_id", "title", "description", "requirements", "benefits", "level", "field_of_study", "country", "city", "pourcentage", "scholarship_type", "duration_months", "application_deadline", "program_start_date", "language", "age_min", "age_max", "gender_requirement", "external_application_url", "active", "created_at", "updated_at") VALUES (2, 'Bourse d''etude', 'La Bourse d’Excellence Internationale de l’Université Horizon vise à soutenir les étudiants méritants issus de tous les continents. Elle couvre intégralement les frais de scolarité et offre une allocation mensuelle pour subvenir aux besoins essentiels de l’étudiant pendant la durée de ses études.

  def update
    if @scholarship.update(scholarship_params)
---
UPDATE "scholarships" SET "title" = 'Bourse d''etude  licence', "updated_at" = '2025-07-09 13:39:21.944240' WHERE "scholarships"."id" = 3

  def destroy
    @scholarship.destroy
---
DELETE FROM "scholarships" WHERE "scholarships"."id" = 3

  def set_scholarship
    @scholarship = Scholarship.find(params[:id])
---
SELECT "scholarships".* FROM "scholarships" WHERE "scholarships"."id" = 3 LIMIT 1