app/controllers/home_controller.rb

SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" IN (2, 3)
SELECT COUNT(*) FROM "institutions"
SELECT COUNT(DISTINCT "scholarships"."country") FROM "scholarships"
---
  def index
    @recent_scholarships = Scholarship.published.includes(:institution).order(created_at: :desc).limit(10)

    @total_scholarships = Scholarship.published.count
    @total_institutions = Institution.count
    @countries_count = Scholarship.published.group(:country).count