app/controllers/institutions_controller.rb

SELECT "institutions".* FROM "institutions"
---
  def index
    @institutions = Institution.all

SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = NULL LIMIT 1
---
  def show
    @institution = Institution.find(params[:id])