app/controllers/profiles_controller.rb

INSERT INTO "student_profiles" ("user_id", "birth_date", "nationality", "current_level", "current_institution", "field_of_study", "bio", "address", "city", "country", "created_at", "updated_at", "wants_notifications", "last_notification_sent_at") VALUES (19, '2025-07-20', 'Nigerienne', 'Master', 'IAT', 'informatique', 'performant, reactif', 'Dan Zama Koira', 'Niamey', 'Niger', '2025-07-13 16:00:05.419699', '2025-07-13 16:00:05.419699', FALSE, NULL) RETURNING "id"
---
  def create
    if current_user.student?
      @profile = current_user.build_student_profile(profile_params)
      if @profile.save