app/controllers/scholarships_controller.rb

    def index
        if params[:query].present?
            @scholarships = Scholarship.search_by_keywords(params[:query])
        else
            @scholarships = Scholarship.all
---
SELECT "scholarships".* FROM "scholarships"

    def show
       @scholarship=Scholarship.find(params[:id])
---
SELECT "scholarships".* FROM "scholarships" WHERE "scholarships"."id" = 1 LIMIT 1