app/models/scholarship.rb

  def matching_students
    students = StudentProfile.joins(:user)

    # Filtre par domaine d'étude (priorité 1)
    students = students.where(field_of_study: field_of_study) if field_of_study.present?

    # Filtre par niveau si spécifié (priorité 2)
    students = students.where(current_level: level) if level.present?

    # Filtre par pays si spécifié (priorité 3)
    students = students.where(country: country) if country.present?

    # Si aucun match strict, essayons juste par domaine
    if students.empty? && field_of_study.present?
      students = StudentProfile.joins(:user).where(field_of_study: field_of_study)
    end

    # En dernier recours, tous les étudiants
    if students.empty?
---
SELECT 1 AS one FROM "student_profiles" INNER JOIN "users" ON "users"."id" = "student_profiles"."user_id" WHERE "student_profiles"."field_of_study" = 'logiciel' AND "student_profiles"."current_level" = 'master' AND "student_profiles"."country" = 'Canada' LIMIT 1
SELECT 1 AS one FROM "student_profiles" INNER JOIN "users" ON "users"."id" = "student_profiles"."user_id" WHERE "student_profiles"."field_of_study" = 'logiciel' LIMIT 1