app/jobs/notification_mailer_job.rb

  def perform(scholarship_id, notification_type)
    Rails.logger.info "🔄 Job started: scholarship_id=#{scholarship_id}, type=#{notification_type}"

    scholarship = Scholarship.find(scholarship_id)
---
SELECT "scholarships".* FROM "scholarships" WHERE "scholarships"."id" = 19 LIMIT 1

 def send_matching_scholarship_notifications(scholarship)
  matching_students = scholarship.matching_students

  Rails.logger.info "👥 Found #{matching_students.count} matching students"

  matching_students.find_each do |student|
    Rails.logger.info "📧 Sending email to: #{student.email}"
    begin
      ScholarshipNotificationMailer.matching_scholarship(student, scholarship).deliver_now
      Rails.logger.info "✅ Email sent successfully to #{student.email}"
    rescue => e
      Rails.logger.error "❌ Error sending email to #{student.email}: #{e.message}"
    end
  end

    # Matching plus flexible : commençons par le field_of_study uniquement
    matching_students = StudentProfile.joins(:user)
                                     .where(field_of_study: scholarship.field_of_study)

    # Si aucun match par field_of_study, essayons avec tous les étudiants
    if matching_students.empty?
      Rails.logger.info "⚠️  No students match field_of_study. Trying all students..."
      matching_students = StudentProfile.joins(:user)
    end

    Rails.logger.info "👥 Found #{matching_students.count} matching students"
---
SELECT "student_profiles".* FROM "student_profiles" INNER JOIN "users" ON "users"."id" = "student_profiles"."user_id" WHERE "student_profiles"."field_of_study" = 'logiciel' ORDER BY "student_profiles"."id" ASC LIMIT 1000
SELECT 1 AS one FROM "student_profiles" INNER JOIN "users" ON "users"."id" = "student_profiles"."user_id" WHERE "student_profiles"."field_of_study" = 'logiciel' LIMIT 1
SELECT COUNT(*) FROM "student_profiles" INNER JOIN "users" ON "users"."id" = "student_profiles"."user_id" WHERE "student_profiles"."field_of_study" = 'logiciel'